{
  "id": 3,
  "category": "Behavioral",
  "competency": "Drive for Results",
  "difficulty": "Intermediate",
  "question": "Tell me about a time when you faced significant obstacles to achieving your goals. How did you overcome them?",
  "ratingCriteria": {
    "excellent": "Shows exceptional perseverance, strategic problem-solving, resourcefulness, and adaptability. Demonstrates clear methodology for overcoming obstacles with quantifiable results and lessons learned that inform future approaches.",
    "good": "Shows strong determination, effective problem-solving, and ability to adapt to challenges. Demonstrates clear actions taken with positive outcomes.",
    "average": "Shows basic persistence and problem-solving, but lacks sophisticated strategy or exceptional results. Demonstrates adequate but not remarkable resolution.",
    "poor": "Shows limited resilience, minimal problem-solving methodology, and tendency to give up or rely heavily on others. Demonstrates incomplete resolution or minimal personal agency.",
    "veryPoor": "Shows lack of perseverance, blames external factors, demonstrates victim mentality, and shows minimal effort to overcome challenges."
  },
  "sampleAnswers": {
    "excellent": "During my junior year at UVA, I led a team of five students in developing a financial literacy program for underserved communities in Charlottesville. We set an ambitious goal of reaching 200 participants within our first semester, but immediately encountered three significant obstacles: no budget allocation from the university, no existing relationships with community organizations, and no precedent for this type of student-led initiative.\n\nI approached these challenges systematically. First, I created a detailed impact projection showing potential community benefits, which I used to secure a $2,500 grant from a local foundation after being rejected by seven other potential funders. This required me to refine our proposal repeatedly, incorporating feedback from each rejection to strengthen our case.\n\nFor the community partnership challenge, I developed a tiered outreach strategy. I researched 15 community organizations, prioritized them based on alignment with our mission, and personally conducted 20+ meetings over three weeks. I created a value proposition specifically for each organization, emphasizing different benefits based on their needs. This resulted in partnerships with four key community centers that collectively provided access to our target demographic.\n\nThe lack of precedent meant we had no roadmap or institutional support. I addressed this by creating a detailed project management framework with clear milestones, accountability metrics, and contingency plans. When our initial workshop format resulted in lower-than-expected engagement, I quickly pivoted our approach, implementing a pre-workshop survey that allowed us to customize content to participants' specific financial concerns.\n\nThe results exceeded our original goals: we reached 237 participants in the first semester, achieved a 92% satisfaction rating, and documented a 40% increase in financial knowledge based on pre/post assessments. The program has since been institutionalized at UVA with dedicated funding and expanded to three additional communities.\n\nThis experience taught me that systematic problem-solving, persistence through rejection, and willingness to continuously adapt are essential when facing significant obstacles. I now approach challenges by breaking them down into addressable components, developing multiple potential solutions, and creating feedback mechanisms to quickly assess and refine my approach.",
    "good": "While serving as the Finance Club Vice President at UVA, I proposed organizing our first investment competition with a $1,000 prize to increase member engagement. However, I faced several significant challenges: our club budget couldn't cover the prize, we had no established framework for judging entries, and initial student interest was much lower than expected.\n\nTo address the funding issue, I developed a sponsorship proposal highlighting the benefits to potential corporate partners, including access to talented students and brand visibility. After reaching out to 12 financial firms and following up persistently, I secured $1,500 from a regional investment firm, which covered our prize and operational costs.\n\nFor the judging framework, I researched similar competitions at other universities and consulted with two finance professors to develop clear, objective evaluation criteria. I created a balanced scorecard approach that assessed investment thesis, risk analysis, and presentation quality, which provided transparency for participants and credibility for our competition.\n\nThe low initial interest was concerning, with only seven students signing up in the first two weeks. I conducted informal interviews with club members to understand their hesitation and discovered that many felt intimidated by the perceived expertise required. In response, I organized two preparatory workshops covering investment analysis fundamentals and brought in a previous competition winner from another university to share insights.\n\nThese efforts turned the situation around. We ultimately had 28 participants (a 300% increase from initial signups), received positive feedback on the judging methodology, and successfully awarded the prize to a deserving winner. The competition has now become an annual event with increased sponsorship and participation.\n\nThis experience taught me the importance of persistence when facing obstacles, the value of seeking expert input, and how addressing underlying concerns rather than just symptoms can dramatically improve outcomes.",
    "average": "Last year, I was working on a research project for my economics class where I needed to collect and analyze data on consumer spending patterns. I faced several obstacles during this project. The main problems were that I couldn't find enough relevant data sources, I had limited time due to my other coursework, and I was having trouble with the statistical analysis software.\n\nTo solve the data problem, I expanded my search beyond the usual academic databases and found some useful information from government economic reports. I also reached out to my professor who suggested a couple of additional resources I hadn't considered.\n\nFor the time management issue, I created a schedule that allocated specific hours each day to work on this project. I prioritized the most important tasks and made sure to stick to my timeline as much as possible.\n\nWith the statistical software, I was struggling with some of the more advanced functions. I spent some time watching tutorial videos online and also asked a classmate who had more experience with the program to help me figure out the specific analyses I needed to run.\n\nIn the end, I was able to complete the project on time and received a B+ grade. My professor commented that my data analysis was solid, though I could have included more depth in some areas. I was satisfied with the outcome given the challenges I had to overcome.",
    "poor": "In my macroeconomics class last semester, I had to complete a project analyzing economic indicators, but I ran into several problems. The assignment was more complicated than I expected, and I had trouble finding the right data for my analysis.\n\nI tried looking through some websites for economic data, but it was confusing to figure out which information was relevant. I spent a lot of time just trying to understand what I was supposed to be doing. It was frustrating because the instructions weren't very clear, in my opinion.\n\nI also had conflicts with other assignments that were due around the same time, so I was feeling pretty overwhelmed. I ended up having to rush through some parts of the project because I was running out of time.\n\nEventually, I asked a classmate for help, and they explained some of the concepts I was struggling with. I managed to find some data online and put together my analysis. I turned in the project a day late, but the professor was understanding and only took off a few points.\n\nI passed the assignment with a C, which wasn't great but at least I completed it. I think if the instructions had been clearer or if I had started earlier, I could have done better.",
    "veryPoor": "I had this really unfair situation in my finance class where the professor assigned this impossible project with unrealistic deadlines. We had to analyze all these companies and create investment recommendations, but the professor didn't even explain properly what we were supposed to do.\n\nThe biggest obstacle was that the assignment was just too hard and nobody in the class really understood it. The professor wasn't helpful when I asked questions after class. He just told me to read the instructions again, which wasn't useful at all.\n\nI also had a lot of other classes and commitments, so I couldn't spend all my time on this one project. It's not reasonable to expect students to drop everything for one assignment.\n\nI tried working on it for a while, but it was just too frustrating. I ended up having to rush through it the night before it was due. I turned it in, but I didn't get a good grade because the professor had these really picky requirements that weren't clearly stated in the first place.\n\nI guess what I learned is that sometimes you just have to deal with unfair situations and move on. Not every assignment is going to be well-designed or reasonable."
  }
}
